#  Pandas :
##       It is python module that make data analysis easy and effective.

# different ways to creating DataFrames

In [3]:
import pandas as pd
import numpy as np

In [6]:
df=pd.read_csv('dataset.csv')
df = pd.DataFrame(df)
type(df['BALANCE'].values)

numpy.ndarray

In [7]:
df1=pd.read_csv('Salary_Data.csv')
df1.describe()

             1.1       39343.00
count  29.000000      29.000000
mean    5.458621   77267.137931
std     2.772250   26995.157605
min     1.300000   37731.000000
25%     3.200000   56957.000000
50%     4.900000   66029.000000
75%     7.900000  101302.000000
max    10.500000  122391.000000

In [11]:
df2=pd.DataFrame({
    'name':['Kaushik','Harshil','Chintan','Prakash'],
    'city':['Himatnagar','Jamnagar','Vadodara','Surat'],
    'city code':[1,2,3,4]
},index=['A','B','C','D'])
df2

      name        city  city code
A  Kaushik  Himatnagar          1
B  Harshil    Jamnagar          2
C  Chintan    Vadodara          3
D  Prakash       Surat          4

## df.head(n) and df.tail(n): 1st one gives first n rows and 2nd one gives last n rows by default n=5

In [37]:
#print(df2.head(3))
#print(df2.tail(3))

In [39]:
#print columns names we use df.columns
#df2.columns

# IMP:
###         CONDITIONAL STATEMENTS AND DESCRIBE

In [14]:
#FOR CONDITION WE USE CONDITION AS BELOW
#FOR SINGLE COLUMN OR SPECIFIC COL USE DF[COLS NAME TO PRINT][CONDITIONS]
# print(df2[df2['city code']>1])
print(df2['city code'][df2['city code']>1])

B    2
C    3
D    4
Name: city code, dtype: int64

In [15]:
#DESCRIBE()
df2.describe()

       city code
count   4.000000
mean    2.500000
std     1.290994
min     1.000000
25%     1.750000
50%     2.500000
75%     3.250000
max     4.000000

In [18]:
#set index and reset index
# print(df2.set_index('name'))
# print(df2.reset_index())

# na_values

In [19]:
df1=pd.read_csv('Salary_Data.csv',na_values=[0,'not available'])
#TO SAVE A CSV FILE USE TO_CSV METHOD
# df1.to_csv('newsalary.csv',index=False,header=False)

### FILL NA VALUES

In [20]:
#FILL na_values WITH FIX VALUE
#newdf=df1.fillna('ABCD')
#print(newdf)
#COLUMN WISE FILL VALUES
#newdf=df1.fillna({
  #  'YearsExperience':'no exp',
 #   'Salary':'No Salary'
#})
#newdf

In [78]:
#FORWORD FILL VALUES,BACKWORD ffill,bfill,limit
#newdf=df1.fillna(method='bfill',limit=1)
#newdf

In [82]:
#PUT INTERMEDIATE VALUES TO NAN VALUES USE INTERPOLATE METHOD
#WE CAN ALSO GIVE A METHOD SO IT CAN BE ABLE TO CALCUTATE VALUES AS PER METHOD
newdf=df1.interpolate()

In [88]:
#TO DROP ROWS HAVING NAN VALUES WE CAN USE dropna() METHOD
#HERE WE CAN ALSO USE how AND threshold AS PER OUR REQUIREMENTS
#newdf=df1.dropna(how='all')
#newdf

# REPLACE VALUES

In [29]:
names=['kaushik','jatin','chintan','harshil','prakash']
marks=[45,43,45,46,46]
p=['good','good','good','very good','very good']

df=pd.DataFrame({
    'name':names,
    'marks':marks,
    'performance':p
})
df

      name  marks performance
0  kaushik     45        good
1    jatin     43        good
2  chintan     45        good
3  harshil     46   very good
4  prakash     46   very good

In [30]:
#REPLCE VALUES IN DATASET
df.replace(['good','very good'],[8,9])
df

      name  marks performance
0  kaushik     45        good
1    jatin     43        good
2  chintan     45        good
3  harshil     46   very good
4  prakash     46   very good

In [31]:
#GROUP BY
g=df.groupby('performance')
print(g.get_group('good'))
#print(g.get_group('very good'))

      name  marks performance
0  kaushik     45        good
1    jatin     43        good
2  chintan     45        good

In [ ]:
#MAX,MIN AND MEAN
print(g.max())
print(g.min())
print(g.mean())

# CONCAT :
      it is used to concate colums or rows in dataset

In [108]:
df1=pd.DataFrame({
    'result':['pass','pass','pass','pass','pass']
})

In [32]:
#vertical concat
print(pd.concat((df,df1)))
# HORIZONTAL CONCAT
print(pd.concat((df,df1),axis=1))

     1.1  39343.00  marks     name performance
0    NaN       NaN   45.0  kaushik        good
1    NaN       NaN   43.0    jatin        good
2    NaN       NaN   45.0  chintan        good
3    NaN       NaN   46.0  harshil   very good
4    NaN       NaN   46.0  prakash   very good
0    1.3   46205.0    NaN      NaN         NaN
1    1.5   37731.0    NaN      NaN         NaN
2    2.0   43525.0    NaN      NaN         NaN
3    2.2   39891.0    NaN      NaN         NaN
4    2.9   56642.0    NaN      NaN         NaN
5    3.0   60150.0    NaN      NaN         NaN
6    3.2   54445.0    NaN      NaN         NaN
7    3.2   64445.0    NaN      NaN         NaN
8    3.7   57189.0    NaN      NaN         NaN
9    3.9   63218.0    NaN      NaN         NaN
10   4.0   55794.0    NaN      NaN         NaN
11   4.0   56957.0    NaN      NaN         NaN
12   4.1   57081.0    NaN      NaN         NaN
13   4.5   61111.0    NaN      NaN         NaN
14   4.9   67938.0    NaN      NaN         NaN
15   5.1   66029.0    NaN      NaN         NaN
16   5.3   83088.0    NaN      NaN         NaN
17   5.9   81363.0    NaN      NaN         NaN
18   6.0   93940.0    NaN      NaN         NaN
19   6.8   91738.0    NaN      NaN         NaN
20   7.1   98273.0    NaN      NaN         NaN
21   7.9  101302.0    NaN      NaN         NaN
22   8.2  113812.0    NaN      NaN         NaN
23   8.7  109431.0    NaN      NaN         NaN
24   9.0  105582.0    NaN      NaN         NaN
25   9.5  116969.0    NaN      NaN         NaN
26   9.6  112635.0    NaN      NaN         NaN
27  10.3  122391.0    NaN      NaN         NaN
28  10.5  121872.0    NaN      NaN         NaN
       name  marks performance   1.1  39343.00
0   kaushik   45.0        good   1.3   46205.0
1     jatin   43.0        good   1.5   37731.0
2   chintan   45.0        good   2.0   43525.0
3   harshil   46.0   very good   2.2   39891.0
4   prakash   46.0   very good   2.9   56642.0
5       NaN    NaN         NaN   3.0   60150.0
6       NaN    NaN         NaN   3.2   54445.0
7       NaN    NaN         NaN   3.2   64445.0
8       NaN    NaN         NaN   3.7   57189.0
9       NaN    NaN         NaN   3.9   63218.0
10      NaN    NaN         NaN   4.0   55794.0
11      NaN    NaN         NaN   4.0   56957.0
12      NaN    NaN         NaN   4.1   57081.0
13      NaN    NaN         NaN   4.5   61111.0
14      NaN    NaN         NaN   4.9   67938.0
15      NaN    NaN         NaN   5.1   66029.0
16      NaN    NaN         NaN   5.3   83088.0
17      NaN    NaN         NaN   5.9   81363.0
18      NaN    NaN         NaN   6.0   93940.0
19      NaN    NaN         NaN   6.8   91738.0
20      NaN    NaN         NaN   7.1   98273.0
21      NaN    NaN         NaN   7.9  101302.0
22      NaN    NaN         NaN   8.2  113812.0
23      NaN    NaN         NaN   8.7  109431.0
24      NaN    NaN         NaN   9.0  105582.0
25      NaN    NaN         NaN   9.5  116969.0
26      NaN    NaN         NaN   9.6  112635.0
27      NaN    NaN         NaN  10.3  122391.0
28      NaN    NaN         NaN  10.5  121872.0

C:\Users\Kaushik\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

# MERGE